// main.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//

#include <iostream>
#include "FastestWay.h"

int main()
{
    std::cout << "Hello World!\n";

	const int n = 6;

	int e1 = 2, e2 = 4;
	int x1 = 3, x2 = 2;

	int a1[n + 1] = { 0, 7, 9, 3, 4, 8, 4 };
	int a2[n + 1] = { 0, 8, 5, 6, 4, 5, 7 };

	int t1[n] = { 0, 2, 3, 1, 3, 4 };
	int t2[n] = { 0, 2, 1, 2, 2, 1 };

	int f1[n + 1] = { 0 };
	int f2[n + 1] = { 0 };

	int L1[n + 1] = { 0 };
	int L2[n + 1] = { 0 };

	int F, L;

	fastest_way(e1, e2, x1, x2, a1, a2, t1, t2, f1, f2, L1, L2, n, F, L);
	print_stations(L1, L2, n, F, L);

	return 0;
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
